In [1]:
from pandas import DataFrame

data = [
    {"cd":"A060310", "nm":"3S", "open":2920, "close":2800},
    {"cd":"A095570", "nm":"AJ네트웍스", "open":1920, "close":1900},
    {"cd":"A006840", "nm":"AK홀딩스", "open":2020, "close":2010},
    {"cd":"A054620", "nm":"APS홀딩스", "open":3120, "close":3200}
]
df = DataFrame(data=data)
df = df.set_index('cd')
df

             nm  open  close
cd
A060310      3S  2920   2800
A095570  AJ네트웍스  1920   1900
A006840   AK홀딩스  2020   2010
A054620  APS홀딩스  3120   3200

In [2]:
cond = df['open'] >= 2000
print(cond)

cd
A060310     True
A095570    False
A006840     True
A054620     True
Name: open, dtype: bool

In [3]:
df[cond]

             nm  open  close
cd
A060310      3S  2920   2800
A006840   AK홀딩스  2020   2010
A054620  APS홀딩스  3120   3200

In [4]:
df[df['open']>=2000]

             nm  open  close
cd
A060310      3S  2920   2800
A006840   AK홀딩스  2020   2010
A054620  APS홀딩스  3120   3200

In [5]:
print(df.query("open < close"))

             nm  open  close
cd
A054620  APS홀딩스  3120   3200

In [7]:
df.query('nm in ["3S","AK홀딩스"]')

            nm  open  close
cd
A060310     3S  2920   2800
A006840  AK홀딩스  2020   2010

In [8]:
df.query('cd == "A054620"')

             nm  open  close
cd
A054620  APS홀딩스  3120   3200